# Exploratory Data Analysis for Titanic Dataset

In [7]:
# import libraries

import pandas as pd
import numpy as np 
import seaborn as sns
import matplotlib.pyplot as plt

In [9]:
# import dataset

# import os
# path = os.getcwd()
# print(f"Path: ", path)

data = pd.read_csv("./Data/Titanic-Dataset.xls")
data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [5]:
# Dataset Analysis

# size of the dataset
size = data.size
# shape of the dataset
shape = data.shape
print(f"Size: ", size, "\n"  "Shape: ", shape)
# datatypes in the dataset
data.dtypes

Size:  10692
Shape:  (891, 12)

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [64]:
# Data Preprocessing

#check for duplicates
duplicate  = data.duplicated().sum()
print(duplicate)

#check for nullValues
missing = data.isnull().sum()
print(missing)

0
PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [ ]:
# handle missing values

# Age
# fill the missing values with the mean of the ages 
# fill the missing values with the mean of the class type

# meanfilling = data['Age'].fillna(data['Age'].mean(), inplace=False)

data['Age'] = data.groupby('Pclass')['Age'].transform(lambda x: x.fillna(x.median()))

# Cabin 
# Missing values are high drop the column

data.drop(columns=["Cabin"], inplace=True)

# Embark
data['Embarked'] = data['Embarked'].fillna(data['Embarked'].mode()[0])

In [68]:
# Stats

stats = data.describe()
print("Stats: ", stats)

info = data.info()
print("Info: ", info)

Stats:         PassengerId    Survived      Pclass         Age       SibSp  \
count   891.000000  891.000000  891.000000  891.000000  891.000000
mean    446.000000    0.383838    2.308642   29.066409    0.523008
std     257.353842    0.486592    0.836071   13.244532    1.102743
min       1.000000    0.000000    1.000000    0.420000    0.000000
25%     223.500000    0.000000    2.000000   22.000000    0.000000
50%     446.000000    0.000000    3.000000   26.000000    0.000000
75%     668.500000    1.000000    3.000000   37.000000    1.000000
max     891.000000    1.000000    3.000000   80.000000    8.000000

            Parch        Fare
count  891.000000  891.000000
mean     0.381594   32.204208
std      0.806057   49.693429
min      0.000000    0.000000
25%      0.000000    7.910400
50%      0.000000   14.454200
75%      0.000000   31.000000
max      6.000000  512.329200
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 11 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          891 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Embarked     891 non-null    object
dtypes: float64(2), int64(5), object(4)
memory usage: 76.7+ KB
Info:  None